// Группы объектов
var groups = [
        {
            name: "Школы",
            style: "islands#redIcon",
            items: [
                {
                    center: [52.2867314523376, 76.97476243524292],
                    name: "ГУ СОШ №1 города Павлодара",
                    address: "Адрес: Суворово 3"

                },
                {
                    center: [52.29466570345018, 76.96112742175664],
                    name: "ГУ СОШ №2 города Павлодара",
                    address: "Адрес: Бухар жырау, 9/1"
                },
                {
                    center: [52.2629225047087, 76.97824441181884],
                    name: "ГУ СОШ №4 города Павлодара",
                    address: "Адрес: Гагарина 58"
                },
                {
                    center: [52.290833620046556, 76.97151012330116],
                    name: "ГУ СОШ №5 города Павлодара",
                    address: "Адрес: Лермонтова, 129"
                },
                {
                    center: [52.29315493183253, 76.95400062716047],
                    name: "ГУ СОШ №6 города Павлодара",
                    address: "Адрес: Урицкого 78"
                },
                {
                    center: [52.28455374559791, 76.94657120158315],
                    name: "ГУ средняя общеобразовательная специализированная школа профильной адаптации №7 города Павлодара",
                    address: "Адрес: Пл.Победы, 13"
                },
                {
                    center: [52.2686639175808, 76.95970927318199],
                    name: "ГУ средняя общеобразовательная школа-гимназия №9 города Павлодара",
                    address: "Адрес: Чокина 90"
                },
                {
                    center: [52.2883424733395, 76.94369759547827],
                    name: "ГУ средняя общеобразовательная школа модульного типа №11 города Павлодара",
                    address: "Адрес: Пл.Победы, 3/1"
                },
                {
                    center: [52.291414970333285, 77.00291166289259],
                    name: "ГУ СОШ №12 города Павлодара",
                    address: "Адрес: Щедрина 60"
                },
                {
                    center: [52.26202085655982, 76.95826718001553],
                    name: "ГУ СОШ №13 города Павлодара",
                    address: "Адрес: Ломова 45/1"
                },
                {
                    center: [52.274167163935225, 76.9730614949801],
                    name: "ГУ СОШ №14 города Павлодара",
                    address: "Адрес: Катаева 36"
                },
                {
                    center: [52.268793117392555, 76.94672571000017],
                    name: "ГУ СОШ №15 города Павлодара",
                    address: "Адрес: Чокина 32"
                },
                {
                    center: [52.30018982204203, 76.92452465209485],
                    name: "ГУ Школа-лицей №16 города Павлодара",
                    address: "Адрес: Айманова 51"
                },
                {
                    center: [52.259482029955144, 76.97530310003967],
                    name: "ГУ средняя общеобразовательная профильная школа дифференцированного обучения №17 города Павлодара",
                    address: "Адрес: Катаева 68"
                },
                {
                    center: [52.296759572909004, 77.0087497564547],
                    name: "ГУ СОШ №18 города Павлодара",
                    address: "Адрес: Геринга 79"
                },
                {
                    center: [52.28352389020816, 76.97882947858571],
                    name: "ГУ СОШ №19 города Павлодара",
                    address: "Адрес: Камзина 62/1"
                },
                {
                    center: [52.273313812616635, 76.96488643630914],
                    name: "ГУ Школа-лицей №20 города Павлодара",
                    address: "Адрес: Горького 102/4"
                },
                {
                    center: [52.24467878726917, 76.99242354746853],
                    name: "ГУ СОШ №21 города Павлодара",
                    address: "Адрес: Камзина 346"
                },
                {
                    center: [52.26712583635804, 76.94858473378102],
                    name: "ГУ СОШ №22 города Павлодара",
                    address: "Адрес: Чокина 27"
                },
                {
                    center: [52.295077681848, 76.97518615326045],
                    name: "ГУ СОШ №23 города Павлодара",
                    address: "Адрес: Бакинская 4"
                },
                {
                    center: [52.25564902664488, 76.96963256754438],
                    name: "ГУ СОШ №24 города Павлодара",
                    address: "Адрес: Кутузова 190"
                },
                {
                    center: [52.24959125412524, 76.95129288482958],
                    name: "ГУ СОШ №25 города Павлодара",
                    address: "Адрес: Майры 49/1"
                },
                {
                    center: [52.25399946107385, 76.98180737318167],
                    name: "ГУ СОШ №26 города Павлодара",
                    address: "Адрес: Семенченко 70"
                },
                {
                    center: [52.29066624101726, 76.97808370571046],
                    name: "ГУ СОШ №27 города Павлодара",
                    address: "Адрес: Павлова 17"
                },
                {
                    center: [52.298562842487605, 76.93475332105143],
                    name: "ГУ СОШ №28 города Павлодара",
                    address: "Адрес: Торайгырова 24"
                },
                {
                    center: [52.28057137636035, 76.97225334250085],
                    name: "ГУ СОШ №29 города Павлодара",
                    address: "Адрес: Катаева 22"
                },
                {
                    center: [52.30718513843924, 76.9185539345461],
                    name: "ГУ СОШ №30 города Павлодара",
                    address: "Адрес: Ледовского 18/3"
                },
                {
                    center: [52.2413576944204, 76.75072706522576],
                    name: "ГУ СОШ №31",
                    address: "Адрес: п.Ленинский, Космонавтов 1"
                },
                {
                    center: [52.25237917871257, 76.79805043358375],
                    name: "ГУ Основная общеобразовательная школа №32 города Павлодара",
                    address: "Адрес: п.Ленинский, Панфилова 65"
                },
                {
                    center: [52.25675124324708, 76.78466078882664],
                    name: "ГУ СОШ №33",
                    address: "Адрес: п.Ленинский, Макаренко 14"
                },
                {
                    center: [52.29052470359207, 76.9574431480401],
                    name: "ГУ СОШ №34 города Павлодара",
                    address: "Адрес: Лермонтова 93/1"
                },
                {
                    center: [52.30189469334113, 76.9235887879471],
                    name: "ГУ СОШ №35 города Павлодара",
                    address: "Адрес: Айманова 37"
                },
                {
                    center: [52.279806679191886, 76.97848139036941],
                    name: "ГУ СОПШЭН №36 города Павлодара",
                    address: "Адрес: Шевченко 1"
                },
                {
                    center: [52.25731815276747, 76.993546997754],
                    name: "ГУ СОШ №37 города Павлодара",
                    address: "Адрес: Ворушина 6/2"
                },
                {
                    center: [52.3834675252916, 77.05045827047182],
                    name: "ГУ Основная общеобразовательная школа №38 города Павлодара",
                    address: "Адрес: п.Мойылды, Абая 1"
                },
                {
                    center: [52.26945089684306, 76.9486248326987],
                    name: "ГУ Средняя общеобразовательная школа инновационного типа №39 с гимназическими классами",
                    address: "Адрес: М. Горького 33"
                },
                {
                    center: [52.386961545415936, 76.85580411125211],
                    name: "ГУ СОШ №40 города Павлодара",
                    address: "Адрес: с.Павлодарское, ул.Береговая 60/1"
                },
                {
                    center: [52.28828443991268, 77.00956794065479],
                    name: "ГУ СОШ №41 города Павлодара",
                    address: "Адрес: Суворова 41"
                },
                {
                    center: [52.25241579608883, 76.94883094619264],
                    name: "ГУ СОШ №42 города Павлодара",
                    address: "Адрес: Ткачева 15"
                },
                {
                    center: [52.29092747566951, 76.9624050001715],
                    name: "ГУ СОШ №43 города Павлодара",
                    address: "Адрес: Лермонтова 95"
                },
                {
                    center: [52.33824958607131, 76.96874260386552],
                    name: "ГУ СОШ №44 города Павлодара",
                    address: "Адрес: Уч. АП 162/2"
                },
                {
                    center: [52.33824958607131, 76.96874260386552],
                    name: "ГУ СОШ №45 города Павлодара",
                    address: "Адрес: Уч. АП 162/3"
                },
                {
                    center: [52.1868437003619, 77.02513038435376],
                    name: "ГУ Кенжекольская средняя общеобразовательная школа",
                    address: "Адрес: с.Кенжеколь, Пл.Победы 1"
                },
                {
                    center: [52.323124523275965, 77.1331118778488],
                    name: "ГУ Жетекшинская средняя общеобразовательная школа",
                    address: "Адрес: с.Жетекші, ул.Мира 5/1"
                }
            ]},
        {
            name: "Дет. сады",
            style: "islands#greenIcon",
            items: [
                {
                    center: [52.278180394896864, 76.97100884158948],
                    name: "ГККП Ясли-сад №1 города Павлодара",
                    address: "Адрес: Кутузова 87/1"
                },
                {
                    center: [52.24034239257692, 76.99626218690655],
                    name: "ГККП Ясли-сад №2 города Павлодара",
                    address: "Адрес: Камзина 360/1"
                },
                {
                    center: [52.29399523726933, 76.98219863501828],
                    name: "ГККП Ясли-сад №3 города Павлодара",
                    address: "Адрес: Камзина 9"
                },
                {
                    center: [52.29950900088915, 76.9218190425014],
                    name: "ГККП Ясли-сад №4 города Павлодара",
                    address: "Адрес: Айманова 13"
                },
                {
                    center: [52.24841219734038, 76.94931224947952],
                    name: "ГККП Ясли-сад №5 города Павлодара",
                    address: "Адрес: майры 41/1"
                },
                {
                    center: [52.26998791922089, 76.94542190017094],
                    name: "ГККП Ясли-сад №6 города Павлодара",
                    address: "Адрес: Сатпаева 241"
                },
                {
                    center: [52.300494397969445, 77.00990175599581],
                    name: "ГККП Ясли-сад №7 города Павлодара",
                    address: "Адрес: Минина 31"
                },
                {
                    center: [52.300438070659766, 76.9201949074876],
                    name: "ГККП Ясли-сад №8 города Павлодара",
                    address: "Адрес: Айманова 22"
                },
                {
                    center: [52.28491402704596, 76.97704462200375],
                    name: "ГККП Ясли-сад №9 города Павлодара",
                    address: "Адрес: Естая 97"
                },
                {
                    center: [52.25267256761905, 76.94999138667596],
                    name: "ГККП Ясли-сад №10 города Павлодара",
                    address: "Адрес: Ткачева 15/1"
                },
                {
                    center: [52.265122801759595, 76.9453496965988],
                    name: "ГККП Ясли-сад №11 города Павлодара",
                    address: "Адрес: Сатпаева 251"
                },
                {
                    center: [52.26943549171961, 76.96242115438908],
                    name: "ГККП Ясли-сад №12 с государственным языком обучения",
                    address: "Адрес: Чокина 96/1"
                },
                {
                    center: [52.29569553642167, 76.96212553993975],
                    name: "ГККП Ясли-сад №14 города Павлодара коррекционного типа для детей с нарушениями речи",
                    address: "Адрес: Торайгырова 99/2"
                },
                {
                    center: [52.25953138726562, 76.78865183085213],
                    name: "ГККП Ясли-сад №15 поселка Ленинский",
                    address: "Адрес: п.Ленинский, ул.Макаренко 1"
                }, 
                {
                    center: [52.27736643779841, 76.97090422715989],
                    name: "ГККП Ясли-сад №16 города Павлодара",
                    address: "Адрес: Камзина 356"
                },
                {
                    center: [52.295409743016016, 76.94941696522729],
                    name: "ГККП Ясли-сад №17 города Павлодара",
                    address: "Адрес: Крупская 76/1"
                },
                {
                    center: [52.30007727724499, 76.93215092900698],
                    name: "ГККП Ясли-сад №18 города Павлодара",
                    address: "Адрес: Мира 11/1"
                },
                {
                    center: [52.28388761055046, 76.95083625173255],
                    name: "ГККП Ясли-сад №19 города Павлодара",
                    address: "Адрес: 1 мая 36"
                },
                {
                    center: [52.18016627379165, 77.02869228250186],
                    name: "ГККП Ясли-сад №20 села Кенжеколь",
                    address: "Адрес: с.Кенжеколь, ул.Токина 3"
                },
                {
                    center: [52.298350898147696, 76.9369232983254],
                    name: "ГККП Ясли-сад №21 города Павлодара",
                    address: "Адрес: Ленина 1/А"
                },
                {
                    center: [52.301963285432144, 76.92501787554156],
                    name: "ГККП Ясли-сад №22 санаторного типа для тубинфицированных детей города Павлодара",
                    address: "Адрес: Айманова 39"
                },
                {
                    center: [52.29319646564773, 76.9947343279535],
                    name: "ГККП Ясли-сад №23 города Павлодара",
                    address: "Адрес: Вс.Иванова 62"
                },
                {
                    center: [52.28849297499909, 76.95699532428773],
                    name: "ГККП Ясли-сад №24 города Павлодара",
                    address: "Адрес: Каирбаева 84"
                },
                {
                    center: [52.261910312265364, 76.96451617687447],
                    name: "ГККП Ясли-сад №25 города Павлодара",
                    address: "Адрес: Гагарина 36/3"
                },
                {
                    center: [52.25932701680098, 76.97906224193005],
                    name: "ГККП Специальный детский сад №26 города Павлодара для детей с нарушениями речи",
                    address: "Адрес: Теплова 46"
                },
                {
                    center: [52.28842460375384, 76.9542705950788],
                    name: "ГККП Ясли-сад №27 города Павлодара",
                    address: "Адрес: 1 мая 27/1"
                },
                {
                    center: [52.29246004514491, 76.96065793962795],
                    name: "ГККП Ясли-сад №28 города Павлодара",
                    address: "Адрес: Лермонтова 98/1"
                },
                {
                    center: [52.25475476268655, 76.98478734250101],
                    name: "ГККП Ясли-сад №29 города Павлодара",
                    address: "Адрес: Радищева 2"
                },
                {
                    center: [52.283074713078825, 76.97494154250094],
                    name: "ГККП Ясли-сад №30 города Павлодара",
                    address: "Адрес: Естая 93"
                },
                {
                    center: [52.29377959783712, 76.9684679029872],
                    name: "ГККП Ясли-сад №31 города Павлодара",
                    address: "Адрес: Кутузова 7/2"
                },
                {
                    center: [52.29521604877061, 76.97066179827819],
                    name: "ГККП Ясли-сад №32 города Павлодара",
                    address: "Адрес: Кутузова 7/1"
                },
                {
                    center: [52.29954887337833, 76.931637984831],
                    name: "ГККП Ясли-сад №33 города Павлодара",
                    address: "Адрес: Гагарина 63"
                },
                {
                    center: [52.26017245286697, 76.96429894055721],
                    name: "ГККП Ясли-сад №34 города Павлодара",
                    address: "Адрес: Торайгырова 16"
                },
                {
                    center: [52.299637083653465, 76.94895535784215],
                    name: "ГККП Ясли-сад №35 города Павлодара",
                    address: "Адрес: Сормова 5/2"
                },
                {
                    center: [52.26028930215112, 76.78880706165059],
                    name: "ГККП Малая дошкольная образовательная организация ясли-сад №36 поселка Ленинский",
                    address: "Адрес: п.Ленинский, ул.Макажанова 13"
                },
                {
                    center: [52.29756002090873, 76.97039525238364],
                    name: "ГККП Ясли-сад №37 города Павлодара",
                    address: "Адрес: Торайгырова 115"
                },
                {
                    center: [52.291521749053445, 76.94205702900675],
                    name: "ГККП Ясли-сад №38 города Павлодара",
                    address: "Адрес: Лермонтова 46/1"
                },
                {
                    center: [52.30152582744647, 76.91920226122012],
                    name: "ГККП Детский сад №39 города Павлодара коррекционного типа для детей с нарушениями интеллекта",
                    address: "Адрес: Айманова 32"
                },
                {
                    center: [52.29193126000485, 76.94546761598488],
                    name: "ГККП Ясли-сад №40 города Павлодара",
                    address: "Адрес: Ген. Дюсенова 15"
                },
                {
                    center: [52.26620892633978, 76.97921735025605],
                    name: "ГККП Ясли-сад №41 города Павлодара",
                    address: "Адрес: Павлова 106/1"
                },
                {
                    center: [52.266438415191566, 76.95115865932681],
                    name: "ГККП Учебно-воспитательный комплекс №42 - дошкольная гимназия-школа с прогимназическими классами города Павлодара",
                    address: "Адрес: Ак.Чокина 33"
                },
                {
                    center: [52.267597629629975, 76.97360257502831],
                    name: "ГККП Ясли-сад №43 города Павлодара",
                    address: "Адрес: Катаева 52"
                },
                {
                    center: [52.25194852022964, 76.94393753909253],
                    name: "ГККП Ясли-сад №44 города Павлодара",
                    address: "Адрес: Ткачева 5/1"
                },
                {
                    center: [52.29528148943363, 76.95277592324713],
                    name: "ГККП Ясли-сад №45 города Павлодара",
                    address: "Адрес: 1 мая 7"
                },
                {
                    center: [52.27020912607263, 76.97852668667646],
                    name: "ГККП Ясли-сад №46 города Павлодара",
                    address: "Адрес: Павлова 82/1"
                },
                {
                    center: [52.383908401436464, 77.04987122937806],
                    name: "ГККП Ясли-сад №47 села Мойылды",
                    address: "Адрес: п.Мойылды, ул.Центральная 2/1"
                },
                {
                    center: [52.300278107802114, 77.00172121926269],
                    name: "ГККП Санаторный ясли-сад №48 города Павлодара",
                    address: "Адрес: Чкалова 128/1"
                },
                {
                    center: [52.29301837802728, 76.99668821264096],
                    name: "ГККП Санаторный ясли-сад №49 города Павлодара",
                    address: "Адрес: Вс.Иванова 49"
                },
                {
                    center: [52.263717041454456, 76.9790474591172],
                    name: "ГККП Ясли-сад №50 города Павлодара",
                    address: "Адрес: Ломова 149/1"
                },
                {
                    center: [52.294886452835556, 76.94221255357918],
                    name: "ГККП Ясли-сад №51 города Павлодара",
                    address: "Адрес: Сатпаева 13"
                },
                {
                    center: [52.29309509606054, 76.9494349294323],
                    name: "ГККП Специальный детский сад №52 города Павлодара",
                    address: "Адрес: Урицкого 76"
                },
                {
                    center: [52.26263847663607, 76.97266566153375],
                    name: "ГККП Ясли-сад №53 города Павлодара",
                    address: "Адрес: Кутузова 159/1"
                },
                {
                    center: [52.29574463065908, 77.0093703997835],
                    name: "ГККП Ясли-сад №54 города Павлодара",
                    address: "Адрес: Якова Геринга 79/1"
                },
                {
                    center: [52.28899203549491, 76.98040360392896],
                    name: "ГККП Ясли-сад №72 города Павлодара",
                    address: "Адрес: Камзина 16а"
                },
                {
                    center: [52.29835108184811, 76.92350302105143],
                    name: "ГККП Ясли-сад №79 города Павлодара",
                    address: "Адрес: Айманова 6"
                },
                {
                    center: [52.288649399362384, 76.97032402697133],
                    name: "ГККП Ясли-сад №82 города Павлодара специализированного типа для детей с нарушениями зрения",
                    address: "Адрес: Кутузова 35/1"
                },
                {
                    center: [52.29395431734691, 77.00953090144772],
                    name: "ГККП Ясли-сад №84 города Павлодара",
                    address: "Адрес: Украинская 99"
                },
                {
                    center: [52.29290434821182, 76.96216046153457],
                    name: "ГККП Ясли-сад №85 города Павлодара",
                    address: "Адрес: Лермонтова 102/1"
                },
                {
                    center: [52.277827072474395, 76.97532649344178],
                    name: "ГККП Ясли-сад №86 города Павлодара",
                    address: "Адрес: Катаева 23"
                },
                {
                    center: [52.289556508474085, 76.94887764794727],
                    name: "ГККП Ясли-сад №93 города Павлодара",
                    address: "Адрес: Бектурова 73"
                },
                {
                    center: [52.28942668839645, 76.9591206261275],
                    name: "ГККП Ясли-сад №96 города Павлодара - Центр гармонического развития &quot;Радуга&quot;",
                    address: "Адрес: Лермонтова 96"
                },
                {
                    center: [52.24084610455826, 76.9964541981485],
                    name: "ГККП Ясли-сад №102 города Павлодара",
                    address: "Адрес: Сатпаева 249"
                },
                {
                    center: [52.27110479761726, 76.97244813823774],
                    name: "ГККП Ясли-сад №104 города Павлодара",
                    address: "Адрес: Кутузова 97/1"
                },
                {
                    center: [52.2784549781747, 76.98084446522688],
                    name: "ГККП Ясли-сад №111 города Павлодара",
                    address: "Адрес: Камзина 80/1"
                },
                {
                    center: [52.283769437716096, 76.97541799036956],
                    name: "ГККП Ясли-сад №112 города Павлодара",
                    address: "Адрес: Естая 91/1"
                },
                {
                    center: [52.284807512060276, 76.96373901920474],
                    name: "ГККП Ясли-сад №115 города Павлодара",
                    address: "Адрес: Кривенко 87/1"
                },
                {
                    center: [52.240666114732555, 76.9956179787202],
                    name: "ГККП Ясли-сад №116 города Павлодара",
                    address: "Адрес: Камзина 360"
                },
                {
                    center: [52.38183226038114, 76.8588747787103],
                    name: "ГККП Ясли-сад №117 села Павлодарское",
                    address: "Адрес: Молодежная 25"
                },
                {
                    center: [52.26910775784337, 76.9503017437537],
                    name: "ГККП №120 центр этонокультурного воспитания с государственным языком обучения",
                    address: "Адрес: Ак.Чокина 40"
                },
                {
                    center: [52.25412573531804, 76.96235186337985],
                    name: "ГККП Ясли-сад №121 города Павлодара",
                    address: "Адрес: Бестужева 4"
                },
                {
                    center: [52.28892325085136, 76.94220500470068],
                    name: "ГККП Дошкольная гимназия №122 города Павлодара",
                    address: "Адрес: Сатпаева 39"
                },
                {
                    center: [52.24871153149458, 76.94687922399365],
                    name: "ГККП Ясли-сад №126 города Павлодара - детский центр эстетического развития",
                    address: "Адрес: Майры 27"
                }
            ]},
        {
            name: "Центры",
            style: "islands#orangeIcon",
            items: [
                {
                    center: [52.313795048666044, 76.91273141389402],
                    name: "ГККП Детско-юношеский центр экологии и туризма",
                    address: "Адрес: Саматова 1/2"
                },
                {
                    center: [52.268866385308215, 76.94658601181901],
                    name: "КГУ Школа Национального возрождения",
                    address: "Адрес: 1 мая 35/1"
                },
                {
                    center: [52.28398781050978, 76.94686044959492],
                    name: "ГККП Детско-подростковый центр &quot;Жигер&quot;",
                    address: "Адрес: Чокина 32"
                },
                {
                    center: [52.28439060190266, 76.95332295448198],
                    name: "ГККП Центр занятости и развитие детской одаренности &quot;Дарын&quot;",
                    address: "Адрес: Пл.Победы 13"
                },
                {
                    center: [52.481329551881785, 76.8159863718505],
                    name: "Учебно-оздоровительный центр &quot;Балдаурен&quot;",
                    address: "Адрес: с.Мичурина, ул. Типкаши строение 1А"
                },
                {
                    center: [52.29081000238824, 76.94413635004987],
                    name: "Учебно-производственный комбинат №2",
                    address: "Адрес: Лермонтова 50"
                }
            ]},
        {
            name: "Муз. школы",
            style: "islands#blueIcon",
            items: [
                {
                    center: [52.28467094276467, 76.95369956673721],
                    name: "ГККП Детская музыкальная школа №1 им. Курмангазы",
                    address: "Адрес: 1 мая 33"
                },
                {
                    center: [52.27931414615787, 76.98191525751552],
                    name: "ГККП Детская музыкальная школа №2",
                    address: "Адрес: Камзина 78"
                },
                {
                    center: [52.294952184326576, 76.97491268025884],
                    name: "ГККП Детская музыкальная школа №3",
                    address: "Адрес: Бакинская 4"
                },
                {
                    center: [52.17938389380076, 77.03059403780362],
                    name: "Кенжекольская детская музыкальная школа",
                    address: "Адрес: Кенжекольская 5"
                }
            ]},
        {
            name: "Худ. школы",
            style: "islands#yellowIcon",
            items: [
                {
                    center: [52.29509222264681, 76.94649353293539],
                    name: "Детская художественная школа №1",
                    address: "Адрес: Бектурова 12"
                },
                {
                    center: [52.250492700617926, 76.942926843162],
                    name: "Детская художественная школа №2",
                    address: "Адрес: Майры 3"
                }
            ]},
        {
            name: "Тех. школы",
            style: "islands#grayIcon",
            items: [
                {
                    center: [52.27720644225984, 76.96568875428076],
                    name: "Детская техническая школа, ГККП",
                    address: "Адрес: Ломова 156/2"
                }
            ]},
    ];


ymaps.ready(init);

function init() {

    // Создание экземпляра карты.
    var myMap = new ymaps.Map('map', {
            center: [52.283369039543224, 76.93993325977007],
            zoom: 17
        }, {
            searchControlProvider: 'yandex#search'
        }),
        // Контейнер для меню.
        menu = $('<ul class="menu"/>');
        
    for (var i = 0, l = groups.length; i < l; i++) {
        createMenuGroup(groups[i]);
    }

    function createMenuGroup (group) {
        // Пункт меню.
        var menuItem = $('<li class="org_type_item"><a href="#" class="org_type_link">' + group.name + '</a></li>'),
        // Коллекция для геообъектов группы.
            collection = new ymaps.GeoObjectCollection(null, { preset: group.style }),
        // Контейнер для подменю.
            submenu = $('<ul class="submenu"/>');

        // Добавляем коллекцию на карту.
        myMap.geoObjects.add(collection);
        // Добавляем подменю.
        menuItem
            .append(submenu)
            // Добавляем пункт в меню.
            .appendTo(menu)
            // По клику удаляем/добавляем коллекцию на карту и скрываем/отображаем подменю.
            .find('a')
            .bind('click', function () {
                if (collection.getParent()) {
                    myMap.geoObjects.remove(collection);
                    submenu.hide();
                } else {
                    myMap.geoObjects.add(collection);
                    submenu.show();
                }
            });
        for (var j = 0, m = group.items.length; j < m; j++) {
            createSubMenu(group.items[j], collection, submenu);
        }
    }

    function createSubMenu (item, collection, submenu) {
        // Пункт подменю.
        var submenuItem = $('<li class="organization_item"><a href="#" class="organization_link">' + item.name + ' <span class="org_address">' + item.address + '</span></a></li>'),
        // Создаем метку.
            placemark = new ymaps.Placemark(item.center, { balloonContent: item.name });

        // Добавляем метку в коллекцию.
        collection.add(placemark);
        // Добавляем пункт в подменю.
        submenuItem
            .appendTo(submenu)
            // При клике по пункту подменю открываем/закрываем баллун у метки.
            .find('a')
            .bind('click', function () {
                if (!placemark.balloon.isOpen()) {
                    placemark.balloon.open();
                } else {
                    placemark.balloon.close();
                }
                return false;
            });
    }

    // Добавляем меню в тэг BODY.
     $("#organizations_list").append(menu);
    // menu.appendTo($('body'));
    // Выставляем масштаб карты чтобы были видны все группы.
    myMap.setBounds(myMap.geoObjects.getBounds());
}